app/controllers/beginnings_controller.rb

  def index
    @beginnings = Beginning.all
---
SELECT `beginnings`.* FROM `beginnings`

  def create
    @beginning = Beginning.new(beginning_params)

    respond_to do |format|
      if @beginning.save
---
INSERT INTO `beginnings` (`name`, `correo`, `descripcion_de_tu_perfil_hobbies_y_pasiones`, `ultimos_dos_trabajos_o_estudios`, `created_at`, `updated_at`) VALUES ('Juan Perez', 'jp@gmail.com', 'Futbol, fiestas', 'Ninguno', '2022-09-17 03:20:41.049401', '2022-09-17 03:20:41.049401')

    def set_beginning
      @beginning = Beginning.find(params[:id])
---
SELECT `beginnings`.* FROM `beginnings` WHERE `beginnings`.`id` = 1 LIMIT 1