app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT `contacts`.* FROM `contacts`